#ifndef SERDES_SERDES_HPP
#define SERDES_SERDES_HPP

//------------------------------------------------------------------------------
/** @file

	@brief Главный подключаемый файл библиотеки

	@details Для использования библиотеки достаточно подключить только этот файл.

    @todo

    @author Niraleks

*/

//------------------------------------------------------------------------------
#include "Core/Concepts.hpp"
#include "Core/Typedefs.hpp"
#include "Core/Api.hpp"

//------------------------------------------------------------------------------
namespace serdes
{

}

//------------------------------------------------------------------------------
#endif
